ec2-galera/vanilla-mysql-standalone/add_2_1800.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            286272
        write:                           102240
        other:                           40896
        total:                           429408
    transactions:                        20448  (11.36 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 388512 (215.83 per sec.)
    other operations:                    40896  (22.72 per sec.)

Test execution summary:
    total time:                          1800.1158s
    total number of events:              20448
    total time taken by event execution: 3599.9006
    per-request statistics:
         min:                                 35.53ms
         avg:                                176.05ms
         max:                               1018.36ms
         approx.  95 percentile:             306.35ms

Threads fairness:
    events (avg/stddev):           10224.0000/12.00
    execution time (avg/stddev):   1799.9503/0.05